
* Create Contents menu
:PROPERTIES:
:DATE:     <2016-03-11 Fri 12:10>
:END:

Backup of edited sidebar tiddler: 

#+BEGIN_EXAMPLE
<$macrocall $name="tabs" tabsList="[all[shadows+tiddlers]tag[$:/tags/SideBar]!has[draft.of]]" default={{$:/config/DefaultSidebarTab}} state="$:/state/tab/sidebar" />
#+END_EXAMPLE

Other version: 

* Incorpore subsections in tiddler - as foldable menu list items
:PROPERTIES:
:DATE:     <2016-03-11 Fri 12:10>
:END:



* Multi-value TIDDLER property
:PROPERTIES:
:TIDDLER:  adf 1234bcd x
:END:

#+BEGIN_SRC emacs-lisp
(char-or-string-p (org-entry-get (point) "TIDDLER"))
#+END_SRC

#+RESULTS:
: t

#+BEGIN_SRC emacs-lisp
(split-string (org-entry-get (point) "TIDDLER"))
#+END_SRC

#+RESULTS:
| adf | 1234bcd |

#+BEGIN_SRC emacs-lisp
(member "x" (split-string (org-entry-get (point) "TIDDLER")))
#+END_SRC

#+RESULTS:
| x |

#+BEGIN_SRC emacs-lisp
(require 'dash)
(-contains? (split-string (org-entry-get (point) "TIDDLER")) "adf")
#+END_SRC

#+RESULTS:
: t

* Github account+repo guessing
:PROPERTIES:
:DATE:     <2016-03-14 Mon 11:04>
:END:

** User login name

#+BEGIN_SRC emacs-lisp
(user-login-name)
#+END_SRC

#+RESULTS:
: iani

** Current directory

#+BEGIN_SRC emacs-lisp
(file-name-nondirectory (directory-file-name (file-name-directory (buffer-file-name))))
#+END_SRC

#+RESULTS:
: implementation-notes

** Full Github repo address

#+BEGIN_SRC emacs-lisp
  (concat
   "git@github.com:"
   (user-login-name)
   "/"
   (file-name-nondirectory
    (directory-file-name (file-name-directory (buffer-file-name))))
   ".git")
#+END_SRC

#+RESULTS:
: git@github.com:iani/implementation-notes.git

** Read github repo address

#+BEGIN_SRC emacs-lisp
  (read-string
   "Enter github repository:"
   (concat
    "git@github.com:"
    (user-login-name)
    "/"
    (file-name-nondirectory
     (directory-file-name (file-name-directory (buffer-file-name))))
    ".git"))
#+END_SRC
